In [1]:
# Import libraries
import pandas as pd
import sys

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]
Pandas version 1.2.4

In [3]:
# Our small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a','a','b','b','c']}

# Create dataframe
df = pd.DataFrame(d)
df

   one  two letter
0    1    2      a
1    1    2      a
2    1    2      b
3    1    2      b
4    1    2      c

In [4]:
# Create group object
one = df.groupby('letter')

# Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [5]:
letterone = df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [6]:
letterone.index

MultiIndex([('a', 1),
            ('b', 1),
            ('c', 1)],
           names=['letter', 'one'])

In [7]:
letterone = df.groupby(['letter','one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [8]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')